anuapi/app/controllers/v1/films_controller.rb

INSERT INTO "films" ("title", "genre", "rating", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@films = Film.new(parameter)

		if @films.save