anuapi/app/controllers/v1/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@user = User.create(user_param)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "zetc0dexxx"], ["updated_at", "2018-05-24 10:30:00.142868"], ["id", 1]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(update_param)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 10]]
---
	def delete
		# @user = User.find(params[:id]) karena pake current_user
		@user.destroy